# StartingViewSettings Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
StartingViewSettings Class
Members See Also
---
The initial view settings for a document dictate which view will initially be open when this model is opened. These settings are available for all Revit project documents.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class StartingViewSettings : Element
```

Visual Basic
---
```text
Public Class StartingViewSettings _
	Inherits Element
```

Visual C++
---
```text
public ref class StartingViewSettings : public Element
```

# Remarks
If worksharing is enabled, the same settings will be used by the central model and all local files and the settings will live in the Project Info workset.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..StartingViewSettings
# See Also
StartingViewSettings Members
Autodesk.Revit.DB Namespace